**Consider the following Python dictionary data and Create a DataFrame using the dictionary:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

In [2]:
import DataFrame(data)
print(dpandas as pd
import numpy as np
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
df = pdf)

SyntaxError: invalid syntax (<ipython-input-2-d3149505e7c7>, line 1)

**1. Create a DataFrame birds from this dictionary**

In [ ]:
birdset = df['birds']
birdset

0        Cranes
1        Cranes
2       plovers
3    spoonbills
4    spoonbills
5        Cranes
6       plovers
7        Cranes
8    spoonbills
9    spoonbills
Name: birds, dtype: object

**2. Display a summary of the basic information about birds DataFrame and its data. I want information like mean variance,std-dev,min,max and percentiles**

In [ ]:
ma = df['visits'].max()
min = df['visits'].min()
print(ma)
print(min)

4
2

In [ ]:
q = df['age'].quantile([.1, .25, .5, .75])
q

NameError: name 'df' is not defined

In [ ]:
s = df['age'].std()
s

2.0077973005261263

In [ ]:
m = df['age'].mean()
m

4.4375

**3. Print the first 2 rows of the birds dataframe **

In [ ]:
k = print(birdset.iloc[:2])

0    Cranes
1    Cranes
Name: birds, dtype: object

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [ ]:
print(df[['birds', 'age']])

        birds  age
0      Cranes  3.5
1      Cranes  4.0
2     plovers  1.5
3  spoonbills  NaN
4  spoonbills  6.0
5      Cranes  3.0
6     plovers  5.5
7      Cranes  NaN
8  spoonbills  8.0
9  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [ ]:
k =  df[['birds','age','visits']]

k.iloc[[2,3,7],:]

        birds  age  visits
2     plovers  1.5       3
3  spoonbills  NaN       4
7      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [ ]:
c = df[(df['visits'] < 4)]
c

        birds  age  visits priority
0      Cranes  3.5       2      yes
2     plovers  1.5       3       no
4  spoonbills  6.0       3       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [ ]:
print(aa[aa['age'].isnull()])

   age  visits
3  NaN       4
7  NaN       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [ ]:
c = df[(df['age'] < 4)]
c

     birds  age  visits priority
0   Cranes  3.5       2      yes
2  plovers  1.5       3       no
5   Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [ ]:
r =  df[(df['age'] >= 2) & (df['age'] <= 4)]
r

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
5      Cranes  3.0       4       no
9  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [ ]:
cr = df.groupby(['birds'], as_index=False)['visits'].sum()
cr.iloc[0]

birds     Cranes
visits        12
Name: 0, dtype: object

**11. Calculate the mean age for each different birds in dataframe.**

In [ ]:
ma = df.groupby(['birds'], as_index=False)['age'].mean()
ma

        birds  age
0      Cranes  3.5
1     plovers  3.5
2  spoonbills  6.0

**12. Append a new row to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [ ]:
d = {'birds' :['chidiya'], 'age' : [2], 'visits' : [2], 'priority' : ['yes']}
df2 = pd.DataFrame(d)

df = df.append(df2)
df

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
4  spoonbills  6.0       3       no
5      Cranes  3.0       4       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no
0     chidiya  2.0       2      yes

In [ ]:
df.index = [0,1,2,3,4,5,6,7,8,9,10]
df

         birds  age  visits priority
0       Cranes  3.5       2      yes
1       Cranes  4.0       4      yes
2      plovers  1.5       3       no
3   spoonbills  NaN       4      yes
4   spoonbills  6.0       3       no
5       Cranes  3.0       4       no
6      plovers  5.5       2       no
7       Cranes  NaN       2      yes
8   spoonbills  8.0       3       no
9   spoonbills  4.0       2       no
10     chidiya  2.0       2      yes

In [ ]:
df = df.drop([10])
df

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
4  spoonbills  6.0       3       no
5      Cranes  3.0       4       no
6     plovers  5.5       2       no
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
9  spoonbills  4.0       2       no

In [ ]:
df.index = [0,1,2,3,4,5,6,7,8,9,10]
df

         birds  age  visits priority
0       Cranes  3.5       2      yes
1       Cranes  4.0       4      yes
2      plovers  1.5       3       no
3   spoonbills  NaN       4      yes
4   spoonbills  6.0       3       no
5       Cranes  3.0       4       no
6      plovers  5.5       2       no
7       Cranes  NaN       2      yes
8   spoonbills  8.0       3       no
9   spoonbills  4.0       2       no
10     chidiya  2.0       2      yes

**13. Find the number of each type of birds in dataframe (Counts)**

In [ ]:
print (df['birds'].value_counts())

spoonbills    4
Cranes        4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [ ]:
df.sort_values(by=['visits'], inplace=True, ascending=True)
df

        birds  age  visits priority
6     plovers  5.5       2       no
9  spoonbills  4.0       2       no
0      Cranes  3.5       2      yes
7      Cranes  NaN       2      yes
8  spoonbills  8.0       3       no
4  spoonbills  6.0       3       no
2     plovers  1.5       3       no
1      Cranes  4.0       4      yes
5      Cranes  3.0       4       no
3  spoonbills  NaN       4      yes

In [ ]:
df.sort_values(by=['age'], inplace=True, ascending=False)
df

        birds  age  visits priority
8  spoonbills  8.0       3       no
4  spoonbills  6.0       3       no
6     plovers  5.5       2       no
1      Cranes  4.0       4      yes
9  spoonbills  4.0       2       no
0      Cranes  3.5       2      yes
5      Cranes  3.0       4       no
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
7      Cranes  NaN       2      yes

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [ ]:
df['priority'] = df['priority'].map(lambda x: 1 if x == 'yes' else 0)
df['priority'] = df['priority'].astype(int)
df

        birds  age  visits  priority
0      Cranes  3.5       2         1
1      Cranes  4.0       4         1
2     plovers  1.5       3         0
3  spoonbills  NaN       4         1
4  spoonbills  6.0       3         0
5      Cranes  3.0       4         0
6     plovers  5.5       2         0
7      Cranes  NaN       2         1
8  spoonbills  8.0       3         0
9  spoonbills  4.0       2         0

**16. In the 'birds' column, change the 'plovers' entries to 'trumpeters'.**

In [ ]:
df['birds'].replace('plovers', 'trumpeters')

0        Cranes
1        Cranes
2    trumpeters
3    spoonbills
4    spoonbills
5        Cranes
6    trumpeters
7        Cranes
8    spoonbills
9    spoonbills
Name: birds, dtype: object

17. What is the average age of Cranes given priority is yes.

In [ ]:
r =  df[(df['birds'] == 'Cranes') & (df['priority'] == 'yes')]
r['age'].mean()

3.9791666666666665

18. What is the average age of each bird given that their no. of visits is 2 and priority is yes.

In [ ]:
r =  df[(df['visits'] == 2) & (df['priority'] == 'yes')]
r['age'].mean()

3.96875

19. Replace the Nan values in Age column by taking median values of all the age of birds

In [ ]:
df.replace(np.nan, m)

        birds     age  visits priority
0      Cranes  3.5000       2      yes
1      Cranes  4.0000       4      yes
2     plovers  1.5000       3       no
3  spoonbills  4.4375       4      yes
4  spoonbills  6.0000       3       no
5      Cranes  3.0000       4       no
6     plovers  5.5000       2       no
7      Cranes  4.4375       2      yes
8  spoonbills  8.0000       3       no
9  spoonbills  4.0000       2       no

20.How many unique birds are present in data?

In [ ]:
print (df['birds'].unique())

['Cranes' 'plovers' 'spoonbills']